MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/efuse/rtw_efuse.c
	return status;
}


u8 rtw_efuse_map_write(PADAPTER adapter, u16 addr, u16 cnts, u8 *data)
{
	struct dvobj_priv *d;
	u8 *efuse = NULL;
	u32 alloc_size;
	u16 mask_alloc_size;
	u32 size;
	int err;
	u8 *mask_buf = NULL;
	u8 *ver_buf = NULL;
	u16 mask_len = 0;
	u32 backupRegs[4] = {0};
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(adapter);
	PEFUSE_HAL pEfuseHal = &pHalData->EfuseHal;
	u8 status = _SUCCESS;

	efuse_PreUpdateAction(adapter, backupRegs);

	d = adapter_to_dvobj(adapter);
	err = rtw_halmac_get_logical_efuse_size(d, &size);
	RTW_INFO("halmac get log efuse size: %d\n", size);
	if (err) {
		status = _FAIL;
		goto exit;
	}

	if ((addr + cnts) > size) {
		status = _FAIL;
		goto exit;
	}

	if (pEfuseHal->EfuseVerCompare == _TRUE)
		alloc_size = size + EFUSE_VER_LEN;
	else
		alloc_size = size;

	efuse = rtw_zmalloc(alloc_size);
	if (!efuse) {
		status = _FAIL;
		goto exit;
	}

	ver_buf = rtw_zmalloc(EFUSE_VER_LEN);
	if (!ver_buf) {
		status = _FAIL;
		goto exit;
	}
	_rtw_memset(ver_buf, 0, EFUSE_VER_LEN);
	rtw_get_efuse_ver_array(adapter, ver_buf);


	mask_len =  sizeof(u8) * rtw_get_efuse_mask_arraylen(adapter);

	if (pEfuseHal->EfuseVerCompare == _TRUE)
		mask_alloc_size = mask_len + EFUSE_VER_LEN;
	else
		mask_alloc_size = mask_len;

	if (mask_alloc_size > 0) {
		mask_buf = rtw_zmalloc(mask_alloc_size);
		if (!mask_buf) {
			status = _FAIL;
			goto exit;
		}
		_rtw_memset(mask_buf, 0, mask_alloc_size);
	} else {
		RTW_INFO("Error mask alloc buf Len: %d\n", mask_alloc_size);
		goto exit;
	}

	err = rtw_halmac_read_logical_efuse_map(d, efuse, size, NULL, 0);
	if (err) {
		status = _FAIL;
		goto exit;
	}

	_rtw_memcpy(efuse + addr, data, cnts);

	if (adapter->registrypriv.boffefusemask == 0) {
		RTW_INFO("Use mask Array Len: %d\n", mask_len);

		if (mask_len != 0) {
			if (adapter->registrypriv.bFileMaskEfuse == _TRUE) {

				if (pEfuseHal->EfuseVerCompare == _TRUE) {
					_rtw_memcpy(mask_buf, maskfileBuffer, pEfuseHal->EfuseMaskUsedBytes);
				} else
					_rtw_memcpy(mask_buf, maskfileBuffer, mask_len);

			} else {
				rtw_efuse_mask_array(adapter, mask_buf);

				if (pEfuseHal->EfuseVerCompare == _TRUE) {
					_rtw_memcpy(mask_buf + mask_len, ver_buf, EFUSE_VER_LEN);
					_rtw_memcpy(efuse + size, ver_buf, EFUSE_VER_LEN);
				}
			}

			err = rtw_halmac_write_logical_efuse_map(d, efuse, size, mask_buf, mask_len);
		} else
			err = rtw_halmac_write_logical_efuse_map(d, efuse, size, NULL, 0);
	} else {
		_rtw_memset(mask_buf, 0xFF, mask_len);
		RTW_INFO("Efuse mask off\n");
		if (pEfuseHal->EfuseVerCompare == _TRUE) {
			_rtw_memcpy(mask_buf + mask_len, ver_buf, EFUSE_VER_LEN);
			_rtw_memcpy(efuse + size, ver_buf, EFUSE_VER_LEN);
			mask_len = mask_len + EFUSE_VER_LEN;
		}
		err = rtw_halmac_write_logical_efuse_map(d, efuse, size, mask_buf, mask_len);
	}

	if (err)
		status = _FAIL;
	else
		status = _SUCCESS;
exit :
	if (efuse)
		rtw_mfree(efuse, alloc_size);
	if (mask_buf)
		rtw_mfree(mask_buf, mask_alloc_size);
	if (ver_buf)
		rtw_mfree(ver_buf, EFUSE_VER_LEN);

	efuse_PostUpdateAction(adapter, backupRegs);

	return status;
}

int Efuse_PgPacketRead(PADAPTER adapter, u8 offset, u8 *data, BOOLEAN test)
{
	return _FALSE;
}

int Efuse_PgPacketWrite(PADAPTER adapter, u8 offset, u8 word_en, u8 *data, BOOLEAN test)
{
	return _FALSE;
}

static void rtw_bt_mask_map_read(PADAPTER padapter, u16 addr, u16 cnts, u8 *data)
{
	u16 i = 0;

#ifdef CONFIG_BT_EFUSE_MASK
	if (padapter->registrypriv.boffefusemask == 0) {
			for (i = 0; i < cnts; i++) {
				if (padapter->registrypriv.bBTFileMaskEfuse == _TRUE) {
						if (rtw_file_efuse_IsMasked(padapter, addr + i, btmaskfileBuffer)) /*use BT file efuse mask.*/
							data[i] = 0xff;
						else
							RTW_INFO("data[%x] = %x\n", i, data[i]);
				} else {
						if (efuse_IsBT_Masked(padapter, addr + i)) /*use drv internal efuse mask.*/
							data[i] = 0xff;
						else
							RTW_INFO("data[%x] = %x\n", i, data[i]);
					}
			}
	}
#endif /*CONFIG_BT_EFUSE_MASK*/
}

u8 rtw_BT_efuse_map_read(PADAPTER adapter, u16 addr, u16 cnts, u8 *data)
{
	hal_ReadEFuse_BT_logic_map(adapter, addr, cnts, data);

	rtw_bt_mask_map_read(adapter, addr, cnts, data);

	return _SUCCESS;
}


static u16
hal_EfuseGetCurrentSize_BT(
	PADAPTER	padapter,
	u8			bPseudoTest)
{
#ifdef HAL_EFUSE_MEMORY
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PEFUSE_HAL		pEfuseHal = &pHalData->EfuseHal;
#endif
	u16 btusedbytes;
	u16	efuse_addr;
	u8	bank, startBank;
	u8	hoffset = 0, hworden = 0;
	u8	efuse_data, word_cnts = 0;
	u16	retU2 = 0;


	btusedbytes = fakeBTEfuseUsedBytes;

	efuse_addr = (u16)((btusedbytes % EFUSE_BT_REAL_BANK_CONTENT_LEN));
	startBank = (u8)(1 + (btusedbytes / EFUSE_BT_REAL_BANK_CONTENT_LEN));

	RTW_INFO("%s: start from bank=%d addr=0x%X\n", __FUNCTION__, startBank, efuse_addr);
	retU2 = EFUSE_BT_REAL_CONTENT_LEN - EFUSE_PROTECT_BYTES_BANK;

	for (bank = startBank; bank < 3; bank++) {
		if (hal_EfuseSwitchToBank(padapter, bank, bPseudoTest) == _FALSE) {
			RTW_ERR("%s: switch bank(%d) Fail!!\n", __FUNCTION__, bank);
			/* bank = EFUSE_MAX_BANK; */
			break;
		}

		/* only when bank is switched we have to reset the efuse_addr. */
		if (bank != startBank)
			efuse_addr = 0;


		while (AVAILABLE_EFUSE_ADDR(efuse_addr)) {
			if (rtw_efuse_bt_access(padapter, _FALSE, efuse_addr, 1, &efuse_data) == _FALSE) {
				RTW_ERR("%s: efuse_OneByteRead Fail! addr=0x%X !!\n", __FUNCTION__, efuse_addr);
				/* bank = EFUSE_MAX_BANK; */
				break;
			}
			RTW_INFO("%s: efuse_OneByteRead ! addr=0x%X !efuse_data=0x%X! bank =%d\n", __FUNCTION__, efuse_addr, efuse_data, bank);

			if (efuse_data == 0xFF)
				break;

			if (EXT_HEADER(efuse_data)) {
				hoffset = GET_HDR_OFFSET_2_0(efuse_data);
				efuse_addr++;
				rtw_efuse_bt_access(padapter, _FALSE, efuse_addr, 1, &efuse_data);
				RTW_INFO("%s: efuse_OneByteRead EXT_HEADER ! addr=0x%X !efuse_data=0x%X! bank =%d\n", __FUNCTION__, efuse_addr, efuse_data, bank);

				if (ALL_WORDS_DISABLED(efuse_data)) {
					efuse_addr++;
					continue;
				}

				/*				hoffset = ((hoffset & 0xE0) >> 5) | ((efuse_data & 0xF0) >> 1); */
				hoffset |= ((efuse_data & 0xF0) >> 1);
				hworden = efuse_data & 0x0F;
			} else {
				hoffset = (efuse_data >> 4) & 0x0F;
				hworden =  efuse_data & 0x0F;
			}

			RTW_INFO(FUNC_ADPT_FMT": Offset=%d Worden=%#X\n",
				 FUNC_ADPT_ARG(padapter), hoffset, hworden);

			word_cnts = Efuse_CalculateWordCnts(hworden);
			/* read next header */
			efuse_addr += (word_cnts * 2) + 1;
		}
		/* Check if we need to check next bank efuse */
		if (efuse_addr < retU2)
			break;/* don't need to check next bank. */
	}
	retU2 = ((bank - 1) * EFUSE_BT_REAL_BANK_CONTENT_LEN) + efuse_addr;

	fakeBTEfuseUsedBytes = retU2;
	RTW_INFO("%s: CurrentSize=%d\n", __FUNCTION__, retU2);
	return retU2;
}

